tutorials/multiphase/interFoam/RAS/mixerVessel/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

baffles
{
    rotating
    {
        type        faceZone;
        zoneName    rotating;

        patches
        {
            master
            {
                name            nonCouple1;
                type            patch;
                inGroups        (nonCouple);
            }

            slave
            {
                name            nonCouple2;
                type            patch;
                inGroups        (nonCouple);
            }
        }
    }
}


// ************************************************************************* //
